
#include <iostream>
#include <ctime>

using namespace std;

//Удалить дубликаты из массива, сохранив порядок.
//Попробовать это реализовать с текущим статическим массиом, одним и без динамической памяти

//Если в массиве есть повторяющиеся элементы - удалить их из массива
// И уменьшить размер массива на 1 (то есть можно не выводить то, что остается без значения)
//Также, количество элементов массива не должно быть const - его нужно будет изменять после удаления каждого дубликата


int main(){
    setlocale(LC_ALL, "Rus");
    srand(time(NULL));
    
    int SIZE_before = 5;
    int SIZE_after = SIZE_before;
    
    
    int arr[SIZE_before];
    //Инициализация массива и вывод его элементов на экран
    cout<<"SIze os the arr is " << SIZE_before << endl;
    cout<<"[";
    for (int i = 0; i < SIZE_before; i++) {
        arr[i] = rand()%5+1;
        cout<<" "<<arr[i];
    }
    cout<<" ]" <<endl;
    
    
    //Цикл сравнения двух разных чисел массива под разным индексом
    for (int i = 0; i < SIZE_before; i++) {
        for (int j = 0; j < SIZE_before; j++) {
            //Проверка на то, что мы действительно сравниваем разные числа, а не одно и то же
            if(i != j){
                //Если числа все же равны
                if(arr[i] == arr[j] && arr[j] != 0){
                    //Нам нужно это число изменить следующим по списку(реализовать сдвиг слево)
                    //И убавить индексы на 1 для повторной проверки чисел
                    int k = j;
                    //Выполняем сдвиг
                    while(k < SIZE_before){
                        //Если следующий элемент в массиве - он становится на его место
                        if(k+1 < SIZE_before){
                            arr[k] = arr[k+1];
                        }
                        //Если мы вышли за наш массив - элемент последний и он получает 0
                        if(k+1 == SIZE_before){
                            arr[k] = 0;
                            //Как только мы добавляем нуль в массив - мы уменьшаем его размер
                            SIZE_after--;
                        }
                        //Делаем сдвиг каждого элемента
                        k++;
                    }
                    //Уменьшаем индекс для повторной проверки
                    j--;
                    
                }
            }
        }
    }
    SIZE_before = SIZE_after;
    
    //Вывод измененного массива
    cout<<"SIze os the arr is " << SIZE_before << endl;
    cout<<"[";
    for (int i = 0; i < SIZE_before; i++) {
        cout<<" "<<arr[i];
    }
    cout<<" ]" <<endl;
    
    return 0;
}